# Используем официальный образ Golang в качестве базового
FROM golang:1.23-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для кэширования зависимостей на этапе сборки
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download

# Копируем весь исходный код в контейнер
COPY . .

# Собираем весь пакет, а не отдельный файл
RUN go build -o /narxozer ./cmd/api

# Экспонируем порт для приложения
EXPOSE 4000

# Команда запуска приложения
CMD ["/narxozer"]
